Tekla.Structures.Dialog.UIControls.TreeViewDialog
The TreeViewDialog class represents a "template" of a tree view dialog.

Tekla.Structures.Dialog.UIControls.TreeViewDialog.#ctor
Initializes a new instance of the TreeViewDialog class.

Tekla.Structures.Dialog.UIControls.TreeViewDialog.OnLoad(System.EventArgs)
The tree view dialog is only localized when it is not in design mode,
meaning it is shown without localization in Visual Studio.
e: The event arguments.

Tekla.Structures.Dialog.UIControls.TreeViewDialog.components
Required designer variable.

Tekla.Structures.Dialog.UIControls.TreeViewDialog.Dispose(System.Boolean)
Cleans up any resources being used.
disposing: True if managed resources should be disposed; otherwise, false.

Tekla.Structures.Dialog.UIControls.TreeViewDialog.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.

Tekla.Structures.Dialog.UIControls.TreeViewDialog.treeView
The treeView: tree view containing the different nodes (to be changed by the user).

Tekla.Structures.Dialog.UIControls.TreeViewDialog.propertiesLabel
The propertiesLabel: properties of the selected node (to be changed by the user).

Tekla.Structures.Dialog.UIControls.TreeViewDialog.instructionsLabel
The instructionsLabel contains instructions for the dialog (to be changed by the user).

Tekla.Structures.Dialog.UIControls.TreeViewDialog.okCancel
The okCancel: group of buttons for Ok/Cancel.

Tekla.Structures.Dialog.UIControls.TreeViewDialog.contextMenuStrip1
The contextMenuStrip1 (to be changed by the user).